#+TITLE: Dustin's Time Log
#+AUTHOR: Dustin Waldron
#+DATE: Spring 2014
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone

* SPRING 2014 SOFTWARE STUDIO III LOG
** WEEK 1 (2/11/14 - 2/17/14)
*** DONE Studio class time                                           :dustin:
CLOCK: [2014-02-11 Tue 15:00]--[2014-02-11 Tue 17:00] =>  2:00
Took time to make virtualbox pretty

*** DONE Studio class time                                           :dustin:
CLOCK: [2014-02-13 Thu 14:00]--[2014-02-13 Thu 16:00] =>  2:00
Worked with studio group and Colagn to make ERD of websurv

*** DONE Ditching eVIl and learning emacs                            :dustin:
CLOCK: [2014-02-15 Sat 13:00]--[2014-02-15 Sat 17:00] =>  4:00
- did it
Learning emacs commands and life without vim. Confession: Still installed vim 
on virtualbox anyway.

*** DONE Read about Django-rest and angularjs                        :dustin:
CLOCK: [2014-02-17 Mon 11:00]--[2014-02-17 Mon 13:00] =>  2:00
Read and watched a tutorial on django-rest at this link:
blog.kevinastone.com/getting-started-with-django-rest-framework-and-angularjs.html

*** DONE Re-read git documentation.                                  :dustin:
CLOCK: [2014-02-17 Mon 19:00]--[2014-02-17 Mon 21:00] =>  2:00
Learned how to make, merge, and delete branches
and why branches are important. I don't miss svn.


** WEEK 2 (2/18/14 - 2/24/14)
*** DONE Studio class time                                           :dustin:
CLOCK: [2014-02-18 Tue 15:00]--[2014-02-18 Thu 16:00] =>  1:00
Reconfigured ./virtualenvs/ file and made virtualenv 
for websurv complete with exported DJANGO_SETTINGS_MODULE
variable.
  
*** DONE Studio class time                                           :dustin:
CLOCK: [2014-02-20 Thu 14:01]--[2014-02-20 Thu 16:01] =>  2:00
- Discussed UX/Wireframe look, talked about templates and who works on what

*** DONE Worked on templates and boostrap navs                       :dustin:
CLOCK: [2014-02-20 Thu 22:00]--[2014-02-21 Fri 01:00] =>  3:00
- Started naviagation menu and other template files
 
*** DONE Worked more on templates and breadcrumbs                    :dustin:
CLOCK: [2014-02-21 Fri 15:00]--[2014-02-21 Fri 17:00] =>  2:00
- Fixed urls and views file. Mapped cse account with virtualbox. Made static directory and css file and linked to base.html. Plan to modify navbar
  with Adam and make admin configuration page.
  
*** DONE Worked on admin page and templates                          :dustin:
CLOCK: [2014-02-23 Sun 21:00]--[2014-02-24 Mon 01:00] =>  4:00
- Read Django Admin Documentation, modified admin.py file, played with urls/views.py


** WEEK 3 (2/25/14 - 3/3/14)
*** DONE Studio class time                                           :dustin:
CLOCK: [2014-02-25 Tue 15:00]--[2014-02-25 Tue 17:00] =>  2:00
- Code review day! Help newbies with django templates/urls

*** DONE Studio class time                                           :dustin:
CLOCK: [2014-02-27 Thu 14:00]--[2014-02-27 Thu 16:00] =>  2:00
- Eginx, The Habs, and make get_absolute_url link for models in templates

*** TODO Worked more on breadcrumb menu                              :dustin:
CLOCK: [2014-02-27 Thu 12:00]--[2014-02-27 Thu 14:00] =>  2:00
- Worked on views, urls, and breadcrumbs

*** DONE Read in the beginning was the commandline                   :dustin:
CLOCK: [2014-03-01 Sat 17:00]--[2014-03-01 Sat 20:00] =>  3:00
- read paper

*** TODO Fixed breadcrumbs and worked on base.html
CLOCK: [2014-03-03 Mon 9:00]--[2014-03-03 Mon 12:00] =>  3:00
- Fixed breadcrumbs with get_absolute_url implementation, plan to add to other views

** WEEK 4 (3/4/14 - 3/10/14)
*** DONE Studio class time                                           :dustin:
CLOCK: [2014-03-04 Tue 15:00]--[2014-03-04 Tue 16:00] =>  1:00
- studio time to work on templates of variety

*** DONE Studio class time                                           :dustin:
CLOCK: [2014-03-06 Thu 14:00]--[2014-03-06 Thu 16:00] =>  2:00
- Worked on templates; Colgan delegated tasks

*** DONE Read Git documentation over branching :dustin:
CLOCK: [2014-03-06 Thu 17:00]--[2014-03-06 Thu 20:00] =>  3:00
- Git commands and concepts of merging

*** DONE Tinkered with Koding and studio files :dustin:
CLOCK: [2014-03-08 Sat 13:00]--[2014-03-08 Sat 14:00] =>  1:00
- registered with koding and looked at features

*** DONE Read Nginx documentation and finished command line paper and breadcrumbs :dustin:
CLOCK: [2014-03-09 Sun 17:00]--[2014-03-09 Sun 21:00] =>  4:00
- read more on nginx and paper and worked on breadcrumbs

** WEEK 5 (3/11/14 - 3/17/14)
*** Studio class time :dustin:
CLOCK: [2014-03-11 Tue 15:00]--[2014-03-11 Tue 16:00] =>  1:00
- Talked with guest speaker about life on the other side

*** Studio class time :dustin:
CLOCK: [2014-03-13 Thu 13:00]--[2014-03-13 Thu 16:00] =>  3:00
- Worked on code of variety pages and breadcrumbs


** WEEK 6 (3/18/14 - 3/24/14)
*** Studio class time :dustin:

*** Studio class time :dustin:


** WEEK 7 (3/25/14 - 3/31/14)
*** Studio class time :dustin:

*** Studio class time :dustin:


** WEEK 8 (4/1/14 - 4/7/14)
*** Studio class time :dustin:

*** Studio class time :dustin:


** WEEK 9 (4/8/14 - 4/14/14) 
*** Studio class time :dustin:

*** Studio class time :dustin:


** WEEK 10 (4/15/14 - 4/21/14)
*** Studio class time :dustin:

*** Studio class time :dustin:


** WEEK 11 (4/22/14 - 4/28/14)
*** Studio class time :dustin:

*** Studio class time :dustin:


** WEEK 12 (4/29/14 - 5/5/14)
*** Studio class time :dustin:

*** Studio class time :dustin:


** WEEK 13 (5/6/14 - 5/12/14)
*** Studio class time :dustin:

*** Studio class time :dustin:



* CLOCKTABLE CHART
#+BEGIN: clocktable :maxlevel 3 :scope file
Clock summary at [2014-03-13 Thu 13:18]

| Headline                                        | Time    |       |      |
|-------------------------------------------------+---------+-------+------|
| *Total time*                                    | *51:00* |       |      |
|-------------------------------------------------+---------+-------+------|
| SPRING 2014 SOFTWARE STUDIO III LOG             | 51:00   |       |      |
| \__ WEEK 1 (2/11/14 - 2/17/14)                  |         | 12:00 |      |
| \_____ DONE Studio class time                   |         |       | 2:00 |
| \_____ DONE Studio class time                   |         |       | 2:00 |
| \_____ DONE Ditching eVIl and learning emacs    |         |       | 4:00 |
| \_____ DONE Read about Django-rest and...       |         |       | 2:00 |
| \_____ DONE Re-read git documentation.          |         |       | 2:00 |
| \__ WEEK 2 (2/18/14 - 2/24/14)                  |         | 12:00 |      |
| \_____ DONE Studio class time                   |         |       | 1:00 |
| \_____ DONE Studio class time                   |         |       | 2:00 |
| \_____ DONE Worked on templates and boostrap... |         |       | 3:00 |
| \_____ DONE Worked more on templates and...     |         |       | 2:00 |
| \_____ DONE Worked on admin page and templates  |         |       | 4:00 |
| \__ WEEK 3 (2/25/14 - 3/3/14)                   |         | 12:00 |      |
| \_____ DONE Studio class time                   |         |       | 2:00 |
| \_____ DONE Studio class time                   |         |       | 2:00 |
| \_____ TODO Worked more on breadcrumb menu      |         |       | 2:00 |
| \_____ DONE Read in the beginning was the...    |         |       | 3:00 |
| \_____ TODO Fixed breadcrumbs and worked on...  |         |       | 3:00 |
| \__ WEEK 4 (3/4/14 - 3/10/14)                   |         | 11:00 |      |
| \_____ DONE Studio class time                   |         |       | 1:00 |
| \_____ DONE Studio class time                   |         |       | 2:00 |
| \_____ DONE Read Git documentation over...      |         |       | 3:00 |
| \_____ DONE Tinkered with Koding and studio...  |         |       | 1:00 |
| \_____ DONE Read Nginx documentation and...     |         |       | 4:00 |
| \__ WEEK 5 (3/11/14 - 3/17/14)                  |         |  4:00 |      |
| \_____ Studio class time                        |         |       | 1:00 |
| \_____ Studio class time                        |         |       | 3:00 |
#+END:

